turbulentFlatPlate_1_SA/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
209825
(
-0.32865525
-0.31942242
-0.31043302
-0.30168064
-0.29315902
-0.28486209
-0.27678392
-0.26891874
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
385
(
-0.33333333
-0.33333333
-0.33333333
-0.33333333
-0.33333333
-0.33333333
-0.33333333
-0.33333333
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
385
(
2
2
2
2
2
2
2
2
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
545
(
-0.32865525
-0.31942242
-0.31043302
-0.30168064
-0.29315902
-0.28486209
-0.27678392
-0.26891874
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
449
(
0.00048570835
0.0014582714
0.0024331298
0.003410289
0.0043897545
0.0053715316
0.0063556258
0.0073420427
...
)
;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
