turbulentFlatPlate_1_SA/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
209825
(
4.511717e-06
4.511717e-06
4.511717e-06
4.511717e-06
4.511717e-06
4.511717e-06
4.511717e-06
4.511717e-06
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
385
(
4.511717e-06
1.3626488e-05
2.2925782e-05
3.2413335e-05
4.2092958e-05
5.1968539e-05
6.2044046e-05
7.2323525e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
385
(
4.511717e-06
1.3626488e-05
2.2925782e-05
3.2413335e-05
4.2092958e-05
5.1968539e-05
6.2044046e-05
7.2323525e-05
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
545
(
1
1
1
1
1
1
1
1
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
