turbulentFlatPlate_1_SA/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
209825
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
385
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
385
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
545
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
449
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
