turbulentFlatPlate_1_SA/Allrun
#!/bin/sh

blockMesh > log.blockMesh
simpleFoam > logS
# gnuplot "myScripts/resPlot.gnu"
